In [1]:
import numpy as np
import pandas as pd

In [16]:
dic1 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'CORE':['DART','JAVASCRIPT','HTML',np.nan],
    'COMPANY':['GOOGLE','FACEBOOK','FASHION 24', 'NETFLIX'],
    'NET WORTH':['$1Million','$800,000','$500,000','$1Million']
}

In [17]:
dic2 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'YEARS':[5,6,7,8],
    'PROJECTS HANDLED':[80,90,np.nan,120],
    'LIVES TOUCHED':['1Million','800,000','500,000','100,000']
}

In [18]:
dic3 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'COUNTRY':['NIGERIA', 'GHANA', 'UNITED STATES', 'MALI'],
    'LANGUAGES':['ENGLISH', 'ENGLISH', 'ENGLISH', 'FRENCH'],
    'COUNTRIES VISITED':[40,np.nan,60,np.nan]
}
ind = ['']

In [19]:
A = pd.DataFrame(dic1)
B = pd.DataFrame(dic2)
C = pd.DataFrame(dic3)

In [21]:
B

       NAME  YEARS  PROJECTS HANDLED LIVES TOUCHED
0  PRECIOUS      5              80.0      1Million
1     NDIDI      6              90.0       800,000
2     GRACE      7               NaN       500,000
3       OLA      8             120.0       100,000

In [22]:
B.dropna()

       NAME  YEARS  PROJECTS HANDLED LIVES TOUCHED
0  PRECIOUS      5              80.0      1Million
1     NDIDI      6              90.0       800,000
3       OLA      8             120.0       100,000

In [29]:
B[['NAME']]

       NAME
0  PRECIOUS
1     NDIDI
2     GRACE
3       OLA

In [35]:
C.mean()

COUNTRIES VISITED    50.0
dtype: float64

In [37]:
arr1 = np.array([[2,4,5,6,1],[7,3,9,np.nan,3],[3,np.nan,4,np.nan,np.nan],[np.nan,3,2,1,7]])
arr2 = np.array(['A','B','C','D'])
arr3 = np.array(['U','V','W','X','Y'])

In [38]:
dtf = pd.DataFrame(data = arr1, index = arr2, columns = arr3)
dtf

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [50]:
dtf.dropna(thresh=5)

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0

       U      V      W      X      Y
A  False  False  False  False  False
B  False  False  False   True  False
C  False   True  False   True   True
D   True  False  False  False  False